000100 01  TRANSACTION-REC.
000200     05  TRAN-CODE               PIC X(6).
000300     05  TRAN-ACCOUNT-KEY        PIC X(10).
000400     05  TRAN-ACTION             PIC X(10).
000500     05  TRAN-FIELD-NAME         PIC X(10).
000600     05  TRAN-FIELD-SS           PIC XX.
000700     05  TRAN-UPDATE-NUM         PIC S9(7)V99 COMP-3.
000800     05  TRAN-UPDATE-DATA        PIC X(30).
000900     05  FILLER                  PIC X(25).